app/views/principal/index.html.erb

			<tbody>
				<% @apartamento.apartamentos_leituras.order("created_at DESC").each do |leitura| %>
---
SELECT "apartamentos_leituras".* FROM "apartamentos_leituras" WHERE "apartamentos_leituras"."apartamento_id" = 1 ORDER BY created_at DESC