app/controllers/apartamentos_leituras_controller.rb

	def calcular_valores
		leitura = Leitura.find(params[:leitura_id])
---
SELECT "leituras".* FROM "leituras" WHERE "leituras"."id" = $1 LIMIT 1  [["id", "1"]]