app/controllers/leituras_controller.rb

SELECT "leituras".* FROM "leituras" WHERE "leituras"."id" = $1 LIMIT 1  [["id", "10"]]
---
	def calcular_valores
		leitura = Leitura.find(params[:format])