app/controllers/principal_controller.rb

	def index
		@usuario = current_usuario
		@apartamento = current_usuario.apartamento
		@apartamentos = @apartamento.imovel.apartamentos
		@leituras_em_aberto = Apartamento.do_bloco(@apartamento.bloco).do_numero(@apartamento.numero).leituras_em_aberto.first.apartamentos_leituras rescue []
---
SELECT "apartamentos_leituras".* FROM "apartamentos_leituras" WHERE "apartamentos_leituras"."apartamento_id" = 1 ORDER BY created_at DESC